WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
/*
  main.cpp

  Target environment
    PlatformIO / Arduino framework
    Board: d1_mini (LOLIN/WEMOS D1 R2 & mini, ESP8266)
    Library: SmartRC-CC1101-Driver-Lib 3.0.2

  CC1101 wiring
    SCK   -> D5 / GPIO14
    MISO  -> D6 / GPIO12
    MOSI  -> D7 / GPIO13
    CSN   -> D8 / GPIO15
    GDO0  -> D2 / GPIO4   (asynchronous TX data input)
    GDO2  -> D1 / GPIO5   (asynchronous RX data output)
    VCC   -> 3V3
    GND   -> GND

  Web UI / Wi-Fi
    Concurrent AP + station (WIFI_AP_STA).
    - Joins the configured home network, then browse to http://cc1101.local/
      or the router-assigned DHCP address.
    - Always hosts its own SoftAP so a phone can connect directly and reach
      http://192.168.4.1/ with no shared network.
    Credentials come from secrets.ini (git-ignored) via the CFG_WIFI_* build
    defines; copy secrets.ini.example to get started.

  Functions
    - RSSI frequency sweep with 318 MHz garage-remote defaults
    - Tune and fine-adjust around a target frequency
    - Raw OOK/ASK capture from GDO2 and raw playback through GDO0
    - Pulse-width histogram and generic timing/encoding analysis
    - Focused Linear 10-bit and MegaCode 24-bit recognizers
    - Save multiple raw samples to LittleFS
    - Load/decode/delete any saved sample
    - Timer1-driven raw playback of any saved sample
    - Two-button gate operator page (/gate) + assignment page (/gate/config):
      each button replays an assigned sample; gate fires force max TX power

  Endpoints
    /              analysis dashboard
    /gate          two-button operator page (Inner / Outer)
    /gate/config   assign a saved sample + radio settings to each gate button
    /api/*         JSON API (see README); /api/selftest for a one-call health check

  Host tooling
    tools/rfprobe.py   CLI over the JSON API
    tests/             pytest suite (skips unless CC1101_HOST points at a device)
*/

#include <Arduino.h>
#include <SPI.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <LittleFS.h>
#include <SmartRC_CC1101.h>
#include <math.h>

#include "decode.h"

// -----------------------------------------------------------------------------
// Firmware identity (reported on /api/status and /api/selftest for verification)
// -----------------------------------------------------------------------------
#ifndef CFG_FW_VERSION
#define CFG_FW_VERSION "0.1.0-nogit"   // real value comes from scripts/version.py
#endif
static constexpr char FIRMWARE_VERSION[] = CFG_FW_VERSION;
static const char FIRMWARE_BUILD[] = __DATE__ " " __TIME__;

// Cached CC1101 identity registers, filled once in setup().
uint8_t radioPartnum = 0;
uint8_t radioVersionReg = 0;

// -----------------------------------------------------------------------------
// Hardware
// -----------------------------------------------------------------------------
static constexpr uint8_t PIN_CC1101_SCK  = D5;
static constexpr uint8_t PIN_CC1101_MISO = D6;
static constexpr uint8_t PIN_CC1101_MOSI = D7;
static constexpr uint8_t PIN_CC1101_CS   = D8;
static constexpr uint8_t PIN_CC1101_GDO0 = D2;  // module pin 3: async TX data input
static constexpr uint8_t PIN_CC1101_GDO2 = D1;  // module pin 8: async RX data output

// -----------------------------------------------------------------------------
// Wi-Fi settings (concurrent AP + station)
// -----------------------------------------------------------------------------
// The device always runs its own SoftAP so a phone can connect directly to the
// dashboard, and at the same time keeps trying to join the configured home
// network. The same web server answers on both interfaces.
//
// Credentials are NOT stored here. They come from secrets.ini (git-ignored) via
// the CFG_WIFI_* compile-time defines in platformio.ini. The placeholders below
// only apply when nothing overrode them, in which case the station join fails
// and only the SoftAP comes up. See secrets.ini.example.
#ifndef CFG_WIFI_SSID
#define CFG_WIFI_SSID "CHANGE_ME_SSID"
#endif
#ifndef CFG_WIFI_PASS
#define CFG_WIFI_PASS "CHANGE_ME_PASSWORD"
#endif
#ifndef CFG_WIFI_AP_SSID
#define CFG_WIFI_AP_SSID "cc1101-setup"
#endif
#ifndef CFG_WIFI_AP_PASS
#define CFG_WIFI_AP_PASS "CHANGE_ME_AP_PASSWORD"
#endif

// Station: the 2.4 GHz Wi-Fi network the D1 Mini should join.
static constexpr char WIFI_SSID[] = CFG_WIFI_SSID;
static constexpr char WIFI_PASS[] = CFG_WIFI_PASS;
static constexpr char WIFI_HOSTNAME[] = "cc1101";
static constexpr uint32_t WIFI_CONNECT_TIMEOUT_MS = 30000UL;
static constexpr uint32_t WIFI_RETRY_INTERVAL_MS = 10000UL;

// SoftAP: WPA2 password must be at least 8 characters (or empty for an open AP,
// which is not recommended). Browse to http://192.168.4.1/ once joined.
static constexpr char WIFI_AP_SSID[] = CFG_WIFI_AP_SSID;
static constexpr char WIFI_AP_PASS[] = CFG_WIFI_AP_PASS;
// WPA2 needs >= 8 chars; empty is allowed (open AP). Catch a bad secrets.ini
// ap_pass at compile time instead of a silently-dead SoftAP. sizeof includes NUL.
static_assert(sizeof(WIFI_AP_PASS) == 1 || sizeof(WIFI_AP_PASS) >= 9,
              "CFG_WIFI_AP_PASS (secrets.ini [wifi] ap_pass) must be empty or at least 8 characters");
static constexpr uint8_t WIFI_AP_CHANNEL = 6;
static constexpr uint8_t WIFI_AP_MAX_CLIENTS = 4;
static const IPAddress WIFI_AP_IP(192, 168, 4, 1);
static const IPAddress WIFI_AP_GATEWAY(192, 168, 4, 1);
static const IPAddress WIFI_AP_NETMASK(255, 255, 255, 0);

bool mdnsStarted = false;
bool apActive = false;
uint32_t lastWifiRetryMs = 0;

// -----------------------------------------------------------------------------
// Working limits
// -----------------------------------------------------------------------------
static constexpr uint32_t DEFAULT_TARGET_HZ = 318000000UL;
static constexpr uint16_t DEFAULT_CAPTURE_BW_KHZ = 650;
static constexpr uint32_t DEFAULT_SWEEP_START_HZ = 317700000UL;
static constexpr uint32_t DEFAULT_SWEEP_STOP_HZ = 318300000UL;
static constexpr uint32_t DEFAULT_SWEEP_STEP_HZ = 20000UL;
static constexpr uint16_t DEFAULT_SWEEP_DWELL_MS = 3;
static constexpr uint16_t DEFAULT_SWEEP_BW_KHZ = 650;
static constexpr uint32_t DEFAULT_CAPTURE_MS = 2500UL;
static constexpr uint32_t DEFAULT_MIN_PULSE_US = 40UL;

// MegaCode-oriented decode defaults. These remain configurable from the Web UI.
static constexpr uint32_t DEFAULT_MEGA_PULSE_US = 1000UL;
static constexpr uint32_t DEFAULT_MEGA_PULSE_TOL_US = 300UL;
static constexpr uint32_t DEFAULT_MEGA_SYMBOL_US = 6000UL;
static constexpr uint32_t DEFAULT_MEGA_SYMBOL_TOL_US = 1200UL;
static constexpr uint32_t DEFAULT_MEGA_FRAME_GAP_US = 10000UL;
static constexpr uint32_t DEFAULT_MEGA_HEADER_LOW_US = 13000UL;
static constexpr uint32_t DEFAULT_MEGA_HEADER_TOL_US = 3400UL;

static constexpr uint16_t MAX_PULSES = 3072;
static constexpr uint16_t MAX_SWEEP_POINTS = 601;
static constexpr uint32_t MAX_CAPTURE_MS = 10000;

