WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
SmartRC_CC1101 radio;
ESP8266WebServer server(80);

// -----------------------------------------------------------------------------
// Sample format
// -----------------------------------------------------------------------------
#pragma pack(push, 1)
struct SampleHeader {
  char magic[4];          // "315R"
  uint8_t version;        // 1
  uint8_t reserved[3];
  uint32_t frequencyHz;
  uint32_t pulseCount;
  uint32_t durationUs;
};

struct DiskPulse {
  uint32_t durationUs;
  uint8_t level;
};
#pragma pack(pop)

// -----------------------------------------------------------------------------
// Raw pulse buffer
// Each entry describes the logic level held for durationUs.
// -----------------------------------------------------------------------------
volatile uint32_t pulseDurations[MAX_PULSES];
volatile uint8_t pulseLevels[MAX_PULSES];
volatile uint16_t pulseCount = 0;

volatile bool captureActive = false;
volatile bool captureTruncated = false;   // hit MAX_PULSES before the time limit
volatile uint32_t captureLastEdgeUs = 0;
volatile uint8_t capturePreviousLevel = LOW;
uint32_t captureStartUs = 0;
uint32_t captureDeadlineMs = 0;
bool captureDone = false;
uint32_t captureDurationUs = 0;

// -----------------------------------------------------------------------------
// Spectrum sweep state
// -----------------------------------------------------------------------------
uint32_t sweepHz[MAX_SWEEP_POINTS];
int16_t sweepRssi[MAX_SWEEP_POINTS];
uint16_t sweepCount = 0;

bool sweepActive = false;
bool sweepDone = false;
uint32_t sweepStartHz = DEFAULT_SWEEP_START_HZ;
uint32_t sweepStopHz = DEFAULT_SWEEP_STOP_HZ;
uint32_t sweepStepHz = DEFAULT_SWEEP_STEP_HZ;
uint32_t sweepCurrentHz = DEFAULT_SWEEP_START_HZ;
uint16_t sweepDwellMs = DEFAULT_SWEEP_DWELL_MS;
uint16_t sweepBandwidthKhz = DEFAULT_SWEEP_BW_KHZ;

// -----------------------------------------------------------------------------
// Radio/application state
// -----------------------------------------------------------------------------
uint32_t targetFrequencyHz = DEFAULT_TARGET_HZ;
uint16_t targetBandwidthKhz = DEFAULT_CAPTURE_BW_KHZ;
float radioDataRateKBaud = 38.4f;
int txPowerDbm = 10;
bool radioOk = false;
String currentMode = "idle";

// Runtime capture/decode parameters. The browser restores these from localStorage
// and pushes them to the device on page load.
uint32_t minPulseUs = DEFAULT_MIN_PULSE_US;
uint32_t megaPulseUs = DEFAULT_MEGA_PULSE_US;
uint32_t megaPulseTolUs = DEFAULT_MEGA_PULSE_TOL_US;
uint32_t megaSymbolUs = DEFAULT_MEGA_SYMBOL_US;
uint32_t megaSymbolTolUs = DEFAULT_MEGA_SYMBOL_TOL_US;
uint32_t megaFrameGapUs = DEFAULT_MEGA_FRAME_GAP_US;
uint32_t megaHeaderLowUs = DEFAULT_MEGA_HEADER_LOW_US;
uint32_t megaHeaderTolUs = DEFAULT_MEGA_HEADER_TOL_US;

// -----------------------------------------------------------------------------
// Playback state: Timer1 is 5 MHz with TIM_DIV16 => 5 ticks/us.
// -----------------------------------------------------------------------------
volatile uint16_t txIndex = 0;
volatile uint16_t txCount = 0;
volatile bool txDone = true;
volatile bool txInvert = false;

bool playbackRequested = false;
uint8_t playbackRepeats = 1;
bool playbackInvertRequested = false;

// -----------------------------------------------------------------------------
// Gate control (two-button operator page + assignment page)
// -----------------------------------------------------------------------------
// Each gate button replays one saved sample. The assignment (sample + radio
// settings) persists to LittleFS. Every gate fire forces the CC1101 to maximum
// output power: this module has a mismatched/stub antenna and marginal RF
// matching, so link budget is poor and "just open the gate" wins over finesse.
// Staying within local RF regulations is the operator's responsibility.
static constexpr int GATE_TX_POWER_DBM = 12;    // CC1101 max PA setting
static constexpr uint8_t GATE_MIN_REPEATS = 4;  // marginal link => repeat bursts
static constexpr char GATE_CONFIG_PATH[] = "/gate.bin";

#pragma pack(push, 1)
struct GateAssignment {
  char sampleName[24];
  uint32_t frequencyHz;
  uint16_t bandwidthKhz;
  int8_t txPowerDbm;      // kept for the UI; transmit clamps up to GATE_TX_POWER_DBM
  uint8_t repeats;
  uint8_t invert;
  uint8_t reserved[3];
};

struct GateConfigFile {
  char magic[4];          // "GATE"
  uint8_t version;        // 1
  uint8_t reserved[3];
  GateAssignment inner;
  GateAssignment outer;
};
#pragma pack(pop)

GateAssignment gateInner{};
GateAssignment gateOuter{};

bool gateFireRequested = false;
GateAssignment gateFirePlan{};

// -----------------------------------------------------------------------------
// Utility
// -----------------------------------------------------------------------------
static String jsonBool(bool v) {
  return v ? "true" : "false";
}


static String jsonEscape(const String& input) {
  String out;
  out.reserve(input.length() + 8);

  static const char hex[] = "0123456789ABCDEF";
  for(size_t i = 0; i < input.length(); ++i) {
    const uint8_t c = static_cast<uint8_t>(input[i]);
    switch(c) {
      case '"': out += F("\\\""); break;
      case '\\': out += F("\\\\"); break;
      case '\b': out += F("\\b"); break;
      case '\f': out += F("\\f"); break;
      case '\n': out += F("\\n"); break;
      case '\r': out += F("\\r"); break;
      case '\t': out += F("\\t"); break;
      default:
        if(c < 0x20) {
          out += F("\\u00");
          out += hex[(c >> 4) & 0x0F];
          out += hex[c & 0x0F];
        } else {
          out += static_cast<char>(c);
        }
        break;
    }
  }
  return out;
}

static bool valid315BandFrequency(uint32_t hz) {
  return hz >= 300000000UL && hz <= 348000000UL;
}

static String safeName(String n) {
  n.trim();
  String out;
  for(size_t i = 0; i < n.length() && out.length() < 24; ++i) {
    char c = n[i];
    if((c >= 'a' && c <= 'z') ||
       (c >= 'A' && c <= 'Z') ||
       (c >= '0' && c <= '9') || c == '-' || c == '_') {
      out += c;
    }
  }
  if(!out.length()) out = "sample";
  return out;
}

static String samplePath(const String& name) {
  return "/rf315_" + safeName(name) + ".bin";
}

static void sendJson(const String& body, int code = 200) {
  server.send(code, "application/json", body);
}

