WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
static void sendError(const String& msg, int code = 400) {
  sendJson("{\"ok\":false,\"error\":\"" + msg + "\"}", code);
}

static bool isBusy() {
  return captureActive || sweepActive || currentMode == "playback";
}

static void writeGdoFast(uint8_t level) {
  if(level) GPOS = (1U << PIN_CC1101_GDO0);
  else GPOC = (1U << PIN_CC1101_GDO0);
}

// -----------------------------------------------------------------------------
// CC1101 configuration
// -----------------------------------------------------------------------------
static uint32_t setRadioFrequency(uint32_t hz) {
  // Keep the requested frequency authoritative. Some SmartRC/CC1101 combinations
  // have returned 0.0 from getMHZ() even though setMHZ() programmed the radio.
  // Feeding that readback into application state caused the old Web UI to fall
  // back to 0 MHz and made every subsequent sweep target zero.
  radio.setSidle();
  radio.setMHZ((float)hz / 1000000.0f);
  return hz;
}

static void configureRawOok(uint16_t bwKhz) {
  radio.setSidle();

  // SmartRC's external/async mode plus explicit settings for raw GDO0 operation.
  radio.setCCMode(false);
  radio.setModulation(2);       // ASK/OOK
  radio.setDRate(radioDataRateKBaud); // async modem/data-rate reference
  radio.setRxBW((float)bwKhz);
  radio.setSyncMode(0);         // no preamble/sync qualifier
  radio.setWhiteData(false);
  radio.setManchester(false);
  radio.setFEC(false);
  radio.setCrc(false);
  radio.setPktFormat(3);        // asynchronous serial mode
  radio.setPA(txPowerDbm);

  // In asynchronous serial mode GDO0 is the TX data input. Route demodulated
  // RX serial data to GDO2 so RX capture and TX playback use separate MCU pins.
  radio.SpiWriteReg(CC1101_IOCFG0, 0x2E); // GDO0 high impedance while receiving
  radio.SpiWriteReg(CC1101_IOCFG2, 0x0D); // GDO2 serial data output
}

static void configureAnalyzer(uint16_t bwKhz) {
  configureRawOok(bwKhz);

  // Focused RSSI analyzer front-end values used by the Flipper-style approach.
  // SmartRC remains responsible for SPI, frequency calculation and mode control.
  radio.SpiWriteReg(CC1101_MDMCFG3, 0x7F);
  radio.SpiWriteReg(CC1101_AGCCTRL2, 0x07);
  radio.SpiWriteReg(CC1101_AGCCTRL1, 0x08);
  radio.SpiWriteReg(CC1101_AGCCTRL0, 0x30);
  radio.setRxBW((float)bwKhz);
}

static void restoreTargetRx() {
  configureRawOok(targetBandwidthKhz);
  setRadioFrequency(targetFrequencyHz);
  radio.SpiWriteReg(CC1101_IOCFG0, 0x2E);
  radio.SpiWriteReg(CC1101_IOCFG2, 0x0D);
  pinMode(PIN_CC1101_GDO0, INPUT);
  pinMode(PIN_CC1101_GDO2, INPUT);
  radio.SetRx();
}

// -----------------------------------------------------------------------------
// Raw capture ISR and capture control
// -----------------------------------------------------------------------------
void IRAM_ATTR rawEdgeISR() {
  if(!captureActive) return;

  uint32_t now = micros();
  uint32_t duration = now - captureLastEdgeUs;
  uint8_t currentLevel = (GPI & (1U << PIN_CC1101_GDO2)) ? HIGH : LOW;
  uint8_t endedLevel = capturePreviousLevel;

  capturePreviousLevel = currentLevel;
  captureLastEdgeUs = now;

  // Ignore very short async glitches. Levels are stored explicitly so skipped
  // glitches cannot corrupt the later HIGH/LOW sequence.
  if(duration < minPulseUs) return;

  uint16_t i = pulseCount;
  if(i >= MAX_PULSES) {
    captureActive = false;
    captureTruncated = true;
    return;
  }

  pulseDurations[i] = duration;
  pulseLevels[i] = endedLevel;
  pulseCount = i + 1;
}

static void normalizeCapture() {
  uint16_t n = pulseCount;
  if(!n) return;

  uint16_t out = 0;
  for(uint16_t i = 0; i < n; ++i) {
    uint32_t d = pulseDurations[i];
    uint8_t level = pulseLevels[i];
    if(d < minPulseUs) continue;

    if(out && pulseLevels[out - 1] == level) {
      pulseDurations[out - 1] += d;
    } else {
      pulseDurations[out] = d;
      pulseLevels[out] = level;
      ++out;
    }
  }
  pulseCount = out;
}

static void startCapture(uint32_t maxMs) {
  pulseCount = 0;
  captureDone = false;
  captureTruncated = false;
  captureDurationUs = 0;

  configureRawOok(targetBandwidthKhz);
  setRadioFrequency(targetFrequencyHz);
  radio.SpiWriteReg(CC1101_IOCFG0, 0x2E);
  radio.SpiWriteReg(CC1101_IOCFG2, 0x0D);
  pinMode(PIN_CC1101_GDO0, INPUT);
  pinMode(PIN_CC1101_GDO2, INPUT);
  radio.SetRx();
  delayMicroseconds(300);

  capturePreviousLevel = digitalRead(PIN_CC1101_GDO2) ? HIGH : LOW;
  captureStartUs = micros();
  captureLastEdgeUs = captureStartUs;
  captureDeadlineMs = millis() + maxMs;
  captureActive = true;
  currentMode = "recording";

  attachInterrupt(digitalPinToInterrupt(PIN_CC1101_GDO2), rawEdgeISR, CHANGE);
}

static void stopCapture() {
  if(!captureActive && currentMode != "recording") return;

  detachInterrupt(digitalPinToInterrupt(PIN_CC1101_GDO2));

  noInterrupts();
  bool wasActive = captureActive;
  captureActive = false;
  uint32_t now = micros();
  uint32_t tail = now - captureLastEdgeUs;
  uint8_t tailLevel = capturePreviousLevel;
  uint16_t n = pulseCount;
  if(wasActive && tail >= minPulseUs && n < MAX_PULSES) {
    pulseDurations[n] = tail;
    pulseLevels[n] = tailLevel;
    pulseCount = n + 1;
  }
  interrupts();

  radio.setSidle();
  captureDurationUs = now - captureStartUs;
  normalizeCapture();
  captureDone = pulseCount > 0;
  currentMode = "idle";
  restoreTargetRx();
}

// -----------------------------------------------------------------------------
// LittleFS sample storage
// -----------------------------------------------------------------------------
static bool saveCurrentSample(const String& name) {
  if(!captureDone || pulseCount == 0) return false;

  File f = LittleFS.open(samplePath(name), "w");
  if(!f) return false;

  SampleHeader h = {{'3','1','5','R'}, 1, {0,0,0}, targetFrequencyHz, pulseCount, captureDurationUs};
  if(f.write(reinterpret_cast<const uint8_t*>(&h), sizeof(h)) != sizeof(h)) {
    f.close();
    return false;
  }

  for(uint16_t i = 0; i < pulseCount; ++i) {
    DiskPulse p = {pulseDurations[i], pulseLevels[i]};
    if(f.write(reinterpret_cast<const uint8_t*>(&p), sizeof(p)) != sizeof(p)) {
      f.close();
      return false;
    }
  }

  f.close();
  return true;
}

static bool loadSample(const String& name, SampleHeader* headerOut = nullptr) {
  File f = LittleFS.open(samplePath(name), "r");
  if(!f) return false;

  SampleHeader h{};
  if(f.read(reinterpret_cast<uint8_t*>(&h), sizeof(h)) != sizeof(h) ||
     memcmp(h.magic, "315R", 4) != 0 || h.version != 1 ||
     h.pulseCount == 0 || h.pulseCount > MAX_PULSES ||
     !valid315BandFrequency(h.frequencyHz)) {
    f.close();
    return false;
  }

