WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
    server.sendContent("]}");
    server.sendContent("");
  });

  // ---- Gate control -------------------------------------------------------
  server.on("/api/gate", HTTP_GET, []() {
    String s = "{\"ok\":true";
    s += ",\"txPowerForcedDbm\":" + String(GATE_TX_POWER_DBM);
    s += ",\"minRepeats\":" + String(GATE_MIN_REPEATS);
    s += ",\"inner\":" + gateAssignmentJson(gateInner);
    s += ",\"outer\":" + gateAssignmentJson(gateOuter);
    s += "}";
    sendJson(s);
  });

  server.on("/api/gate/assign", HTTP_POST, []() {
    if(!sameOriginOk()) return sendError("cross-origin request rejected", 403);

    String which = server.arg("which");
    if(which != "inner" && which != "outer") {
      return sendError("which must be inner or outer");
    }

    GateAssignment a{};
    const bool clearing = server.arg("sampleName").length() == 0;

    if(!clearing) {
      String name = safeName(server.arg("sampleName"));
      if(!LittleFS.exists(samplePath(name))) return sendError("sample not found");

      uint32_t hz = (uint32_t)server.arg("frequencyHz").toInt();
      uint16_t bw = (uint16_t)server.arg("bandwidthKhz").toInt();
      if(!valid315BandFrequency(hz)) return sendError("frequency must be 300-348 MHz");
      if(bw != 58 && bw != 270 && bw != 650) bw = 650;

      strncpy(a.sampleName, name.c_str(), sizeof(a.sampleName) - 1);
      a.frequencyHz = hz;
      a.bandwidthKhz = bw;
      a.txPowerDbm = GATE_TX_POWER_DBM;
      a.repeats = (uint8_t)constrain(server.arg("repeats").toInt(), 1, 10);
      a.invert = server.arg("invert").toInt() != 0 ? 1 : 0;
    }

    if(which == "inner") gateInner = a;
    else gateOuter = a;

    if(!gateSaveConfig()) return sendError("could not persist gate config", 500);
    sendJson("{\"ok\":true}");
  });

  server.on("/api/gate/fire", HTTP_POST, []() {
    if(!sameOriginOk()) return sendError("cross-origin request rejected", 403);
    if(isBusy() || playbackRequested || gateFireRequested) return sendError("busy", 409);

    String which = server.arg("which");
    const GateAssignment* a = (which == "inner") ? &gateInner
                            : (which == "outer") ? &gateOuter
                            : nullptr;
    if(!a) return sendError("which must be inner or outer");
    if(a->sampleName[0] == '\0') return sendError("gate is unassigned");
    if(!gateAssignmentValid(*a)) return sendError("assignment is invalid");
    if(!LittleFS.exists(samplePath(String(a->sampleName)))) {
      return sendError("assigned sample is missing");
    }

    gateFirePlan = *a;
    gateFireRequested = true;
    sendJson(String("{\"ok\":true,\"which\":\"") + which +
             "\",\"sampleName\":\"" + jsonEscape(String(a->sampleName)) + "\"}");
  });

  server.onNotFound([]() {
    server.send(404, "text/plain", "not found");
  });
}

// -----------------------------------------------------------------------------
// Arduino setup / loop
// -----------------------------------------------------------------------------
void setup() {
  pinMode(PIN_CC1101_GDO0, INPUT);
  pinMode(PIN_CC1101_GDO2, INPUT);

  // D1 Mini hardware SPI: SCK=D5, MISO=D6, MOSI=D7, CSN=D8.
  // Separate raw paths: GDO0=D2 for async TX, GDO2=D1 for async RX.
  radio.setSpiPin(PIN_CC1101_SCK, PIN_CC1101_MISO, PIN_CC1101_MOSI, PIN_CC1101_CS);
  radio.setGDO(PIN_CC1101_GDO0, PIN_CC1101_GDO2);
  radio.Init();
  radioOk = radio.getCC1101();
  radioPartnum = radio.SpiReadStatus(CC1101_PARTNUM);
  radioVersionReg = radio.SpiReadStatus(CC1101_VERSION);

  configureRawOok(targetBandwidthKhz);
  setRadioFrequency(targetFrequencyHz);
  restoreTargetRx();

  if(!LittleFS.begin()) {
    LittleFS.format();
    LittleFS.begin();
  }

  gateLoadConfig();

  startWifi();

  setupRoutes();
  server.begin();
}

void loop() {
  server.handleClient();
  serviceWifi();

  if(captureActive) {
    if(pulseCount >= MAX_PULSES) captureTruncated = true;
    if((int32_t)(millis() - captureDeadlineMs) >= 0 || pulseCount >= MAX_PULSES) {
      stopCapture();
    }
  }

  serviceSweep();

  if(playbackRequested && !isBusy()) {
    playbackRequested = false;
    replayCurrent(playbackRepeats, playbackInvertRequested);
  }

  if(gateFireRequested && !isBusy()) {
    gateFireRequested = false;
    fireGate(gateFirePlan);
  }

  yield();
}

